7767517
119 137
Input                    input.1                  0 1 input.1 -23330=4,3,224,224,3 0=224 1=224 2=3
Convolution              /features/features.0/features.0.0/Conv 1 1 input.1 /features/features.0/features.0.2/HardSwish_output_0 0=16 1=3 3=2 4=1 5=1 6=432 9=6 -23310=2,2.000000e-01,5.000000e-01
Split                    splitncnn_0              1 2 /features/features.0/features.0.2/HardSwish_output_0 /features/features.0/features.0.2/HardSwish_output_0_splitncnn_0 /features/features.0/features.0.2/HardSwish_output_0_splitncnn_1
ConvolutionDepthWise     /features/features.1/block/block.0/block.0.0/Conv 1 1 /features/features.0/features.0.2/HardSwish_output_0_splitncnn_1 /features/features.1/block/block.0/block.0.2/Relu_output_0 0=16 1=3 4=1 5=1 6=144 7=16 9=1
Convolution              /features/features.1/block/block.1/block.1.0/Conv 1 1 /features/features.1/block/block.0/block.0.2/Relu_output_0 /features/features.1/block/block.1/block.1.0/Conv_output_0 0=16 1=1 5=1 6=256
BinaryOp                 /features/features.1/Add 2 1 /features/features.1/block/block.1/block.1.0/Conv_output_0 /features/features.0/features.0.2/HardSwish_output_0_splitncnn_0 /features/features.1/Add_output_0
Convolution              /features/features.2/block/block.0/block.0.0/Conv 1 1 /features/features.1/Add_output_0 /features/features.2/block/block.0/block.0.2/Relu_output_0 0=64 1=1 5=1 6=1024 9=1
ConvolutionDepthWise     /features/features.2/block/block.1/block.1.0/Conv 1 1 /features/features.2/block/block.0/block.0.2/Relu_output_0 /features/features.2/block/block.1/block.1.2/Relu_output_0 0=64 1=3 3=2 4=1 5=1 6=576 7=64 9=1
Convolution              /features/features.2/block/block.2/block.2.0/Conv 1 1 /features/features.2/block/block.1/block.1.2/Relu_output_0 /features/features.2/block/block.2/block.2.0/Conv_output_0 0=24 1=1 5=1 6=1536
Split                    splitncnn_1              1 2 /features/features.2/block/block.2/block.2.0/Conv_output_0 /features/features.2/block/block.2/block.2.0/Conv_output_0_splitncnn_0 /features/features.2/block/block.2/block.2.0/Conv_output_0_splitncnn_1
Convolution              /features/features.3/block/block.0/block.0.0/Conv 1 1 /features/features.2/block/block.2/block.2.0/Conv_output_0_splitncnn_1 /features/features.3/block/block.0/block.0.2/Relu_output_0 0=72 1=1 5=1 6=1728 9=1
ConvolutionDepthWise     /features/features.3/block/block.1/block.1.0/Conv 1 1 /features/features.3/block/block.0/block.0.2/Relu_output_0 /features/features.3/block/block.1/block.1.2/Relu_output_0 0=72 1=3 4=1 5=1 6=648 7=72 9=1
Convolution              /features/features.3/block/block.2/block.2.0/Conv 1 1 /features/features.3/block/block.1/block.1.2/Relu_output_0 /features/features.3/block/block.2/block.2.0/Conv_output_0 0=24 1=1 5=1 6=1728
BinaryOp                 /features/features.3/Add 2 1 /features/features.3/block/block.2/block.2.0/Conv_output_0 /features/features.2/block/block.2/block.2.0/Conv_output_0_splitncnn_0 /features/features.3/Add_output_0
Convolution              /features/features.4/block/block.0/block.0.0/Conv 1 1 /features/features.3/Add_output_0 /features/features.4/block/block.0/block.0.2/Relu_output_0 0=72 1=1 5=1 6=1728 9=1
ConvolutionDepthWise     /features/features.4/block/block.1/block.1.0/Conv 1 1 /features/features.4/block/block.0/block.0.2/Relu_output_0 /features/features.4/block/block.1/block.1.2/Relu_output_0 0=72 1=5 3=2 4=2 5=1 6=1800 7=72 9=1
Split                    splitncnn_2              1 2 /features/features.4/block/block.1/block.1.2/Relu_output_0 /features/features.4/block/block.1/block.1.2/Relu_output_0_splitncnn_0 /features/features.4/block/block.1/block.1.2/Relu_output_0_splitncnn_1
Pooling                  /features/features.4/block/block.2/avgpool/GlobalAveragePool 1 1 /features/features.4/block/block.1/block.1.2/Relu_output_0_splitncnn_1 /features/features.4/block/block.2/avgpool/GlobalAveragePool_output_0 0=1 4=1
InnerProduct             /features/features.4/block/block.2/fc1/Conv 1 1 /features/features.4/block/block.2/avgpool/GlobalAveragePool_output_0 /features/features.4/block/block.2/activation/Relu_output_0 0=24 1=1 2=1728 9=1
InnerProduct             /features/features.4/block/block.2/fc2/Conv 1 1 /features/features.4/block/block.2/activation/Relu_output_0 /features/features.4/block/block.2/fc2/Conv_output_0 0=72 1=1 2=1728
HardSigmoid              /features/features.4/block/block.2/scale_activation/HardSigmoid 1 1 /features/features.4/block/block.2/fc2/Conv_output_0 /features/features.4/block/block.2/scale_activation/HardSigmoid_output_0 0=1.666667e-01
BinaryOp                 /features/features.4/block/block.2/Mul 2 1 /features/features.4/block/block.2/scale_activation/HardSigmoid_output_0 /features/features.4/block/block.1/block.1.2/Relu_output_0_splitncnn_0 /features/features.4/block/block.2/Mul_output_0 0=2
Convolution              /features/features.4/block/block.3/block.3.0/Conv 1 1 /features/features.4/block/block.2/Mul_output_0 /features/features.4/block/block.3/block.3.0/Conv_output_0 0=40 1=1 5=1 6=2880
Split                    splitncnn_3              1 2 /features/features.4/block/block.3/block.3.0/Conv_output_0 /features/features.4/block/block.3/block.3.0/Conv_output_0_splitncnn_0 /features/features.4/block/block.3/block.3.0/Conv_output_0_splitncnn_1
Convolution              /features/features.5/block/block.0/block.0.0/Conv 1 1 /features/features.4/block/block.3/block.3.0/Conv_output_0_splitncnn_1 /features/features.5/block/block.0/block.0.2/Relu_output_0 0=120 1=1 5=1 6=4800 9=1
ConvolutionDepthWise     /features/features.5/block/block.1/block.1.0/Conv 1 1 /features/features.5/block/block.0/block.0.2/Relu_output_0 /features/features.5/block/block.1/block.1.2/Relu_output_0 0=120 1=5 4=2 5=1 6=3000 7=120 9=1
Split                    splitncnn_4              1 2 /features/features.5/block/block.1/block.1.2/Relu_output_0 /features/features.5/block/block.1/block.1.2/Relu_output_0_splitncnn_0 /features/features.5/block/block.1/block.1.2/Relu_output_0_splitncnn_1
Pooling                  /features/features.5/block/block.2/avgpool/GlobalAveragePool 1 1 /features/features.5/block/block.1/block.1.2/Relu_output_0_splitncnn_1 /features/features.5/block/block.2/avgpool/GlobalAveragePool_output_0 0=1 4=1
InnerProduct             /features/features.5/block/block.2/fc1/Conv 1 1 /features/features.5/block/block.2/avgpool/GlobalAveragePool_output_0 /features/features.5/block/block.2/activation/Relu_output_0 0=32 1=1 2=3840 9=1
InnerProduct             /features/features.5/block/block.2/fc2/Conv 1 1 /features/features.5/block/block.2/activation/Relu_output_0 /features/features.5/block/block.2/fc2/Conv_output_0 0=120 1=1 2=3840
HardSigmoid              /features/features.5/block/block.2/scale_activation/HardSigmoid 1 1 /features/features.5/block/block.2/fc2/Conv_output_0 /features/features.5/block/block.2/scale_activation/HardSigmoid_output_0 0=1.666667e-01
BinaryOp                 /features/features.5/block/block.2/Mul 2 1 /features/features.5/block/block.2/scale_activation/HardSigmoid_output_0 /features/features.5/block/block.1/block.1.2/Relu_output_0_splitncnn_0 /features/features.5/block/block.2/Mul_output_0 0=2
Convolution              /features/features.5/block/block.3/block.3.0/Conv 1 1 /features/features.5/block/block.2/Mul_output_0 /features/features.5/block/block.3/block.3.0/Conv_output_0 0=40 1=1 5=1 6=4800
BinaryOp                 /features/features.5/Add 2 1 /features/features.5/block/block.3/block.3.0/Conv_output_0 /features/features.4/block/block.3/block.3.0/Conv_output_0_splitncnn_0 /features/features.5/Add_output_0
Split                    splitncnn_5              1 2 /features/features.5/Add_output_0 /features/features.5/Add_output_0_splitncnn_0 /features/features.5/Add_output_0_splitncnn_1
Convolution              /features/features.6/block/block.0/block.0.0/Conv 1 1 /features/features.5/Add_output_0_splitncnn_1 /features/features.6/block/block.0/block.0.2/Relu_output_0 0=120 1=1 5=1 6=4800 9=1
ConvolutionDepthWise     /features/features.6/block/block.1/block.1.0/Conv 1 1 /features/features.6/block/block.0/block.0.2/Relu_output_0 /features/features.6/block/block.1/block.1.2/Relu_output_0 0=120 1=5 4=2 5=1 6=3000 7=120 9=1
Split                    splitncnn_6              1 2 /features/features.6/block/block.1/block.1.2/Relu_output_0 /features/features.6/block/block.1/block.1.2/Relu_output_0_splitncnn_0 /features/features.6/block/block.1/block.1.2/Relu_output_0_splitncnn_1
Pooling                  /features/features.6/block/block.2/avgpool/GlobalAveragePool 1 1 /features/features.6/block/block.1/block.1.2/Relu_output_0_splitncnn_1 /features/features.6/block/block.2/avgpool/GlobalAveragePool_output_0 0=1 4=1
InnerProduct             /features/features.6/block/block.2/fc1/Conv 1 1 /features/features.6/block/block.2/avgpool/GlobalAveragePool_output_0 /features/features.6/block/block.2/activation/Relu_output_0 0=32 1=1 2=3840 9=1
InnerProduct             /features/features.6/block/block.2/fc2/Conv 1 1 /features/features.6/block/block.2/activation/Relu_output_0 /features/features.6/block/block.2/fc2/Conv_output_0 0=120 1=1 2=3840
HardSigmoid              /features/features.6/block/block.2/scale_activation/HardSigmoid 1 1 /features/features.6/block/block.2/fc2/Conv_output_0 /features/features.6/block/block.2/scale_activation/HardSigmoid_output_0 0=1.666667e-01
BinaryOp                 /features/features.6/block/block.2/Mul 2 1 /features/features.6/block/block.2/scale_activation/HardSigmoid_output_0 /features/features.6/block/block.1/block.1.2/Relu_output_0_splitncnn_0 /features/features.6/block/block.2/Mul_output_0 0=2
Convolution              /features/features.6/block/block.3/block.3.0/Conv 1 1 /features/features.6/block/block.2/Mul_output_0 /features/features.6/block/block.3/block.3.0/Conv_output_0 0=40 1=1 5=1 6=4800
BinaryOp                 /features/features.6/Add 2 1 /features/features.6/block/block.3/block.3.0/Conv_output_0 /features/features.5/Add_output_0_splitncnn_0 /features/features.6/Add_output_0
Convolution              /features/features.7/block/block.0/block.0.0/Conv 1 1 /features/features.6/Add_output_0 /features/features.7/block/block.0/block.0.2/HardSwish_output_0 0=240 1=1 5=1 6=9600 9=6 -23310=2,2.000000e-01,5.000000e-01
ConvolutionDepthWise     /features/features.7/block/block.1/block.1.0/Conv 1 1 /features/features.7/block/block.0/block.0.2/HardSwish_output_0 /features/features.7/block/block.1/block.1.2/HardSwish_output_0 0=240 1=3 3=2 4=1 5=1 6=2160 7=240 9=6 -23310=2,2.000000e-01,5.000000e-01
Convolution              /features/features.7/block/block.2/block.2.0/Conv 1 1 /features/features.7/block/block.1/block.1.2/HardSwish_output_0 /features/features.7/block/block.2/block.2.0/Conv_output_0 0=80 1=1 5=1 6=19200
Split                    splitncnn_7              1 2 /features/features.7/block/block.2/block.2.0/Conv_output_0 /features/features.7/block/block.2/block.2.0/Conv_output_0_splitncnn_0 /features/features.7/block/block.2/block.2.0/Conv_output_0_splitncnn_1
Convolution              /features/features.8/block/block.0/block.0.0/Conv 1 1 /features/features.7/block/block.2/block.2.0/Conv_output_0_splitncnn_1 /features/features.8/block/block.0/block.0.2/HardSwish_output_0 0=200 1=1 5=1 6=16000 9=6 -23310=2,2.000000e-01,5.000000e-01
ConvolutionDepthWise     /features/features.8/block/block.1/block.1.0/Conv 1 1 /features/features.8/block/block.0/block.0.2/HardSwish_output_0 /features/features.8/block/block.1/block.1.2/HardSwish_output_0 0=200 1=3 4=1 5=1 6=1800 7=200 9=6 -23310=2,2.000000e-01,5.000000e-01
Convolution              /features/features.8/block/block.2/block.2.0/Conv 1 1 /features/features.8/block/block.1/block.1.2/HardSwish_output_0 /features/features.8/block/block.2/block.2.0/Conv_output_0 0=80 1=1 5=1 6=16000
BinaryOp                 /features/features.8/Add 2 1 /features/features.8/block/block.2/block.2.0/Conv_output_0 /features/features.7/block/block.2/block.2.0/Conv_output_0_splitncnn_0 /features/features.8/Add_output_0
Split                    splitncnn_8              1 2 /features/features.8/Add_output_0 /features/features.8/Add_output_0_splitncnn_0 /features/features.8/Add_output_0_splitncnn_1
Convolution              /features/features.9/block/block.0/block.0.0/Conv 1 1 /features/features.8/Add_output_0_splitncnn_1 /features/features.9/block/block.0/block.0.2/HardSwish_output_0 0=184 1=1 5=1 6=14720 9=6 -23310=2,2.000000e-01,5.000000e-01
ConvolutionDepthWise     /features/features.9/block/block.1/block.1.0/Conv 1 1 /features/features.9/block/block.0/block.0.2/HardSwish_output_0 /features/features.9/block/block.1/block.1.2/HardSwish_output_0 0=184 1=3 4=1 5=1 6=1656 7=184 9=6 -23310=2,2.000000e-01,5.000000e-01
Convolution              /features/features.9/block/block.2/block.2.0/Conv 1 1 /features/features.9/block/block.1/block.1.2/HardSwish_output_0 /features/features.9/block/block.2/block.2.0/Conv_output_0 0=80 1=1 5=1 6=14720
BinaryOp                 /features/features.9/Add 2 1 /features/features.9/block/block.2/block.2.0/Conv_output_0 /features/features.8/Add_output_0_splitncnn_0 /features/features.9/Add_output_0
Split                    splitncnn_9              1 2 /features/features.9/Add_output_0 /features/features.9/Add_output_0_splitncnn_0 /features/features.9/Add_output_0_splitncnn_1
Convolution              /features/features.10/block/block.0/block.0.0/Conv 1 1 /features/features.9/Add_output_0_splitncnn_1 /features/features.10/block/block.0/block.0.2/HardSwish_output_0 0=184 1=1 5=1 6=14720 9=6 -23310=2,2.000000e-01,5.000000e-01
ConvolutionDepthWise     /features/features.10/block/block.1/block.1.0/Conv 1 1 /features/features.10/block/block.0/block.0.2/HardSwish_output_0 /features/features.10/block/block.1/block.1.2/HardSwish_output_0 0=184 1=3 4=1 5=1 6=1656 7=184 9=6 -23310=2,2.000000e-01,5.000000e-01
Convolution              /features/features.10/block/block.2/block.2.0/Conv 1 1 /features/features.10/block/block.1/block.1.2/HardSwish_output_0 /features/features.10/block/block.2/block.2.0/Conv_output_0 0=80 1=1 5=1 6=14720
BinaryOp                 /features/features.10/Add 2 1 /features/features.10/block/block.2/block.2.0/Conv_output_0 /features/features.9/Add_output_0_splitncnn_0 /features/features.10/Add_output_0
Convolution              /features/features.11/block/block.0/block.0.0/Conv 1 1 /features/features.10/Add_output_0 /features/features.11/block/block.0/block.0.2/HardSwish_output_0 0=480 1=1 5=1 6=38400 9=6 -23310=2,2.000000e-01,5.000000e-01
ConvolutionDepthWise     /features/features.11/block/block.1/block.1.0/Conv 1 1 /features/features.11/block/block.0/block.0.2/HardSwish_output_0 /features/features.11/block/block.1/block.1.2/HardSwish_output_0 0=480 1=3 4=1 5=1 6=4320 7=480 9=6 -23310=2,2.000000e-01,5.000000e-01
Split                    splitncnn_10             1 2 /features/features.11/block/block.1/block.1.2/HardSwish_output_0 /features/features.11/block/block.1/block.1.2/HardSwish_output_0_splitncnn_0 /features/features.11/block/block.1/block.1.2/HardSwish_output_0_splitncnn_1
Pooling                  /features/features.11/block/block.2/avgpool/GlobalAveragePool 1 1 /features/features.11/block/block.1/block.1.2/HardSwish_output_0_splitncnn_1 /features/features.11/block/block.2/avgpool/GlobalAveragePool_output_0 0=1 4=1
InnerProduct             /features/features.11/block/block.2/fc1/Conv 1 1 /features/features.11/block/block.2/avgpool/GlobalAveragePool_output_0 /features/features.11/block/block.2/activation/Relu_output_0 0=120 1=1 2=57600 9=1
InnerProduct             /features/features.11/block/block.2/fc2/Conv 1 1 /features/features.11/block/block.2/activation/Relu_output_0 /features/features.11/block/block.2/fc2/Conv_output_0 0=480 1=1 2=57600
HardSigmoid              /features/features.11/block/block.2/scale_activation/HardSigmoid 1 1 /features/features.11/block/block.2/fc2/Conv_output_0 /features/features.11/block/block.2/scale_activation/HardSigmoid_output_0 0=1.666667e-01
BinaryOp                 /features/features.11/block/block.2/Mul 2 1 /features/features.11/block/block.2/scale_activation/HardSigmoid_output_0 /features/features.11/block/block.1/block.1.2/HardSwish_output_0_splitncnn_0 /features/features.11/block/block.2/Mul_output_0 0=2
Convolution              /features/features.11/block/block.3/block.3.0/Conv 1 1 /features/features.11/block/block.2/Mul_output_0 /features/features.11/block/block.3/block.3.0/Conv_output_0 0=112 1=1 5=1 6=53760
Split                    splitncnn_11             1 2 /features/features.11/block/block.3/block.3.0/Conv_output_0 /features/features.11/block/block.3/block.3.0/Conv_output_0_splitncnn_0 /features/features.11/block/block.3/block.3.0/Conv_output_0_splitncnn_1
Convolution              /features/features.12/block/block.0/block.0.0/Conv 1 1 /features/features.11/block/block.3/block.3.0/Conv_output_0_splitncnn_1 /features/features.12/block/block.0/block.0.2/HardSwish_output_0 0=672 1=1 5=1 6=75264 9=6 -23310=2,2.000000e-01,5.000000e-01
ConvolutionDepthWise     /features/features.12/block/block.1/block.1.0/Conv 1 1 /features/features.12/block/block.0/block.0.2/HardSwish_output_0 /features/features.12/block/block.1/block.1.2/HardSwish_output_0 0=672 1=3 4=1 5=1 6=6048 7=672 9=6 -23310=2,2.000000e-01,5.000000e-01
Split                    splitncnn_12             1 2 /features/features.12/block/block.1/block.1.2/HardSwish_output_0 /features/features.12/block/block.1/block.1.2/HardSwish_output_0_splitncnn_0 /features/features.12/block/block.1/block.1.2/HardSwish_output_0_splitncnn_1
Pooling                  /features/features.12/block/block.2/avgpool/GlobalAveragePool 1 1 /features/features.12/block/block.1/block.1.2/HardSwish_output_0_splitncnn_1 /features/features.12/block/block.2/avgpool/GlobalAveragePool_output_0 0=1 4=1
InnerProduct             /features/features.12/block/block.2/fc1/Conv 1 1 /features/features.12/block/block.2/avgpool/GlobalAveragePool_output_0 /features/features.12/block/block.2/activation/Relu_output_0 0=168 1=1 2=112896 9=1
InnerProduct             /features/features.12/block/block.2/fc2/Conv 1 1 /features/features.12/block/block.2/activation/Relu_output_0 /features/features.12/block/block.2/fc2/Conv_output_0 0=672 1=1 2=112896
HardSigmoid              /features/features.12/block/block.2/scale_activation/HardSigmoid 1 1 /features/features.12/block/block.2/fc2/Conv_output_0 /features/features.12/block/block.2/scale_activation/HardSigmoid_output_0 0=1.666667e-01
BinaryOp                 /features/features.12/block/block.2/Mul 2 1 /features/features.12/block/block.2/scale_activation/HardSigmoid_output_0 /features/features.12/block/block.1/block.1.2/HardSwish_output_0_splitncnn_0 /features/features.12/block/block.2/Mul_output_0 0=2
Convolution              /features/features.12/block/block.3/block.3.0/Conv 1 1 /features/features.12/block/block.2/Mul_output_0 /features/features.12/block/block.3/block.3.0/Conv_output_0 0=112 1=1 5=1 6=75264
BinaryOp                 /features/features.12/Add 2 1 /features/features.12/block/block.3/block.3.0/Conv_output_0 /features/features.11/block/block.3/block.3.0/Conv_output_0_splitncnn_0 /features/features.12/Add_output_0
Convolution              /features/features.13/block/block.0/block.0.0/Conv 1 1 /features/features.12/Add_output_0 /features/features.13/block/block.0/block.0.2/HardSwish_output_0 0=672 1=1 5=1 6=75264 9=6 -23310=2,2.000000e-01,5.000000e-01
ConvolutionDepthWise     /features/features.13/block/block.1/block.1.0/Conv 1 1 /features/features.13/block/block.0/block.0.2/HardSwish_output_0 /features/features.13/block/block.1/block.1.2/HardSwish_output_0 0=672 1=5 3=2 4=2 5=1 6=16800 7=672 9=6 -23310=2,2.000000e-01,5.000000e-01
Split                    splitncnn_13             1 2 /features/features.13/block/block.1/block.1.2/HardSwish_output_0 /features/features.13/block/block.1/block.1.2/HardSwish_output_0_splitncnn_0 /features/features.13/block/block.1/block.1.2/HardSwish_output_0_splitncnn_1
Pooling                  /features/features.13/block/block.2/avgpool/GlobalAveragePool 1 1 /features/features.13/block/block.1/block.1.2/HardSwish_output_0_splitncnn_1 /features/features.13/block/block.2/avgpool/GlobalAveragePool_output_0 0=1 4=1
InnerProduct             /features/features.13/block/block.2/fc1/Conv 1 1 /features/features.13/block/block.2/avgpool/GlobalAveragePool_output_0 /features/features.13/block/block.2/activation/Relu_output_0 0=168 1=1 2=112896 9=1
InnerProduct             /features/features.13/block/block.2/fc2/Conv 1 1 /features/features.13/block/block.2/activation/Relu_output_0 /features/features.13/block/block.2/fc2/Conv_output_0 0=672 1=1 2=112896
HardSigmoid              /features/features.13/block/block.2/scale_activation/HardSigmoid 1 1 /features/features.13/block/block.2/fc2/Conv_output_0 /features/features.13/block/block.2/scale_activation/HardSigmoid_output_0 0=1.666667e-01
BinaryOp                 /features/features.13/block/block.2/Mul 2 1 /features/features.13/block/block.2/scale_activation/HardSigmoid_output_0 /features/features.13/block/block.1/block.1.2/HardSwish_output_0_splitncnn_0 /features/features.13/block/block.2/Mul_output_0 0=2
Convolution              /features/features.13/block/block.3/block.3.0/Conv 1 1 /features/features.13/block/block.2/Mul_output_0 /features/features.13/block/block.3/block.3.0/Conv_output_0 0=160 1=1 5=1 6=107520
Split                    splitncnn_14             1 2 /features/features.13/block/block.3/block.3.0/Conv_output_0 /features/features.13/block/block.3/block.3.0/Conv_output_0_splitncnn_0 /features/features.13/block/block.3/block.3.0/Conv_output_0_splitncnn_1
Convolution              /features/features.14/block/block.0/block.0.0/Conv 1 1 /features/features.13/block/block.3/block.3.0/Conv_output_0_splitncnn_1 /features/features.14/block/block.0/block.0.2/HardSwish_output_0 0=960 1=1 5=1 6=153600 9=6 -23310=2,2.000000e-01,5.000000e-01
ConvolutionDepthWise     /features/features.14/block/block.1/block.1.0/Conv 1 1 /features/features.14/block/block.0/block.0.2/HardSwish_output_0 /features/features.14/block/block.1/block.1.2/HardSwish_output_0 0=960 1=5 4=2 5=1 6=24000 7=960 9=6 -23310=2,2.000000e-01,5.000000e-01
Split                    splitncnn_15             1 2 /features/features.14/block/block.1/block.1.2/HardSwish_output_0 /features/features.14/block/block.1/block.1.2/HardSwish_output_0_splitncnn_0 /features/features.14/block/block.1/block.1.2/HardSwish_output_0_splitncnn_1
Pooling                  /features/features.14/block/block.2/avgpool/GlobalAveragePool 1 1 /features/features.14/block/block.1/block.1.2/HardSwish_output_0_splitncnn_1 /features/features.14/block/block.2/avgpool/GlobalAveragePool_output_0 0=1 4=1
InnerProduct             /features/features.14/block/block.2/fc1/Conv 1 1 /features/features.14/block/block.2/avgpool/GlobalAveragePool_output_0 /features/features.14/block/block.2/activation/Relu_output_0 0=240 1=1 2=230400 9=1
InnerProduct             /features/features.14/block/block.2/fc2/Conv 1 1 /features/features.14/block/block.2/activation/Relu_output_0 /features/features.14/block/block.2/fc2/Conv_output_0 0=960 1=1 2=230400
HardSigmoid              /features/features.14/block/block.2/scale_activation/HardSigmoid 1 1 /features/features.14/block/block.2/fc2/Conv_output_0 /features/features.14/block/block.2/scale_activation/HardSigmoid_output_0 0=1.666667e-01
BinaryOp                 /features/features.14/block/block.2/Mul 2 1 /features/features.14/block/block.2/scale_activation/HardSigmoid_output_0 /features/features.14/block/block.1/block.1.2/HardSwish_output_0_splitncnn_0 /features/features.14/block/block.2/Mul_output_0 0=2
Convolution              /features/features.14/block/block.3/block.3.0/Conv 1 1 /features/features.14/block/block.2/Mul_output_0 /features/features.14/block/block.3/block.3.0/Conv_output_0 0=160 1=1 5=1 6=153600
BinaryOp                 /features/features.14/Add 2 1 /features/features.14/block/block.3/block.3.0/Conv_output_0 /features/features.13/block/block.3/block.3.0/Conv_output_0_splitncnn_0 /features/features.14/Add_output_0
Split                    splitncnn_16             1 2 /features/features.14/Add_output_0 /features/features.14/Add_output_0_splitncnn_0 /features/features.14/Add_output_0_splitncnn_1
Convolution              /features/features.15/block/block.0/block.0.0/Conv 1 1 /features/features.14/Add_output_0_splitncnn_1 /features/features.15/block/block.0/block.0.2/HardSwish_output_0 0=960 1=1 5=1 6=153600 9=6 -23310=2,2.000000e-01,5.000000e-01
ConvolutionDepthWise     /features/features.15/block/block.1/block.1.0/Conv 1 1 /features/features.15/block/block.0/block.0.2/HardSwish_output_0 /features/features.15/block/block.1/block.1.2/HardSwish_output_0 0=960 1=5 4=2 5=1 6=24000 7=960 9=6 -23310=2,2.000000e-01,5.000000e-01
Split                    splitncnn_17             1 2 /features/features.15/block/block.1/block.1.2/HardSwish_output_0 /features/features.15/block/block.1/block.1.2/HardSwish_output_0_splitncnn_0 /features/features.15/block/block.1/block.1.2/HardSwish_output_0_splitncnn_1
Pooling                  /features/features.15/block/block.2/avgpool/GlobalAveragePool 1 1 /features/features.15/block/block.1/block.1.2/HardSwish_output_0_splitncnn_1 /features/features.15/block/block.2/avgpool/GlobalAveragePool_output_0 0=1 4=1
InnerProduct             /features/features.15/block/block.2/fc1/Conv 1 1 /features/features.15/block/block.2/avgpool/GlobalAveragePool_output_0 /features/features.15/block/block.2/activation/Relu_output_0 0=240 1=1 2=230400 9=1
InnerProduct             /features/features.15/block/block.2/fc2/Conv 1 1 /features/features.15/block/block.2/activation/Relu_output_0 /features/features.15/block/block.2/fc2/Conv_output_0 0=960 1=1 2=230400
HardSigmoid              /features/features.15/block/block.2/scale_activation/HardSigmoid 1 1 /features/features.15/block/block.2/fc2/Conv_output_0 /features/features.15/block/block.2/scale_activation/HardSigmoid_output_0 0=1.666667e-01
BinaryOp                 /features/features.15/block/block.2/Mul 2 1 /features/features.15/block/block.2/scale_activation/HardSigmoid_output_0 /features/features.15/block/block.1/block.1.2/HardSwish_output_0_splitncnn_0 /features/features.15/block/block.2/Mul_output_0 0=2
Convolution              /features/features.15/block/block.3/block.3.0/Conv 1 1 /features/features.15/block/block.2/Mul_output_0 /features/features.15/block/block.3/block.3.0/Conv_output_0 0=160 1=1 5=1 6=153600
BinaryOp                 /features/features.15/Add 2 1 /features/features.15/block/block.3/block.3.0/Conv_output_0 /features/features.14/Add_output_0_splitncnn_0 /features/features.15/Add_output_0
Convolution              /features/features.16/features.16.0/Conv 1 1 /features/features.15/Add_output_0 /features/features.16/features.16.2/HardSwish_output_0 0=960 1=1 5=1 6=153600 9=6 -23310=2,2.000000e-01,5.000000e-01
Pooling                  /avgpool/GlobalAveragePool 1 1 /features/features.16/features.16.2/HardSwish_output_0 /Flatten_output_0 0=1 4=1
InnerProduct             /classifier/classifier.0/Gemm 1 1 /Flatten_output_0 /classifier/classifier.1/HardSwish_output_0 0=1400 1=1 2=1344000 9=6 -23310=2,2.000000e-01,5.000000e-01
InnerProduct             /classifier/classifier.3/Gemm 1 1 /classifier/classifier.1/HardSwish_output_0 /classifier/classifier.3/Gemm_output_0 0=1075 1=1 2=1505000
Softmax                  /classifier/classifier.4/Softmax 1 1 /classifier/classifier.3/Gemm_output_0 499
